src/Catalogs/уатРабочиеСтолы/уатРабочиеСтолы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>уатРабочиеСтолы</name>
  <comment>(уат)</comment>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ЗаказыМаршрутныеЛисты</name>
      <description>Заказы + Маршрутные листы</description>
    </items>
    <items>
      <name>ЗаказыСтатистикаМаршрутныеЛистыПланировщик</name>
      <description>Заказы + Статистика + Маршрутные листы + Планировщик</description>
    </items>
    <items>
      <name>Карта</name>
      <description>Карта</description>
    </items>
    <items>
      <name>КартаПункты</name>
      <description>Карта + Пункты</description>
    </items>
    <items>
      <name>КартаСобытия</name>
      <description>Карта + События</description>
    </items>
  </predefined>
  <attributes>
    <name>Назначение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>НастройкиПанелей</name>
    <attributes>
      <name>Панель</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СсылкаНаОтчет</name>
      <type>
        <types>String</types>
        <types>CatalogRef.ВариантыОтчетов</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/уатРабочиеСтолы/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	уатЗащищенныеФункцииСервер.уатСправочникФормаЭлементаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, Объект, ЭтотОбъект, ДопПараметрыОткрытие);
	Если Отказ тогда
		Возврат;
	КонецЕсли;
	
	Заголовок = НСтр("ru = 'Настройка панелей АРМ'");
	
	Если НЕ уатОбщегоНазначенияПовтИсп.ВариантПоставкиКОРП() Тогда
		Элементы.Назначение.Видимость = Ложь;
		Объект.Назначение = НСтр("en = 'AWP Transportation control'; ru = 'АРМ Контроль перевозок'");
	КонецЕсли;
	
	Если Объект.Назначение <> НСтр("en = 'AWP Logistician'; ru = 'АРМ Логиста'") 
		ИЛИ Объект.Назначение <> НСтр("en = 'AWP Transportation control'; ru = 'АРМ Контроль перевозок'") Тогда
		Если Объект.Назначение = "AWP Logistician" ИЛИ Объект.Назначение = "АРМ Логиста" Тогда
			Объект.Назначение = НСтр("en = 'AWP Logistician'; ru = 'АРМ Логиста'");
		ИначеЕсли Объект.Назначение = "AWP Transportation control" ИЛИ Объект.Назначение = "АРМ Контроль перевозок" Тогда
			Объект.Назначение = НСтр("en = 'AWP Transportation control'; ru = 'АРМ Контроль перевозок'");
		Иначе
			Объект.Назначение = НСтр("en = 'AWP Logistician'; ru = 'АРМ Логиста'");
		КонецЕсли;
	КонецЕсли;
	
	Элементы.Назначение.СписокВыбора.Очистить();
	Элементы.Назначение.СписокВыбора.Добавить(НСтр("en = 'AWP Logistician'; ru = 'АРМ Логиста'"));
	Элементы.Назначение.СписокВыбора.Добавить(НСтр("en = 'AWP Transportation control'; ru = 'АРМ Контроль перевозок'"));
	
	Элементы.Панель1.СписокВыбора.Очистить();
	Элементы.Панель2.СписокВыбора.Очистить();
	Элементы.Панель3.СписокВыбора.Очистить();
	Элементы.Панель4.СписокВыбора.Очистить();

	Для Сч = 1 По 4 Цикл
		Если Объект.Назначение = НСтр("en = 'AWP Logistician'; ru = 'АРМ Логиста'") Тогда
			Элементы["Панель" + Сч].СписокВыбора.Добавить(НСтр("en = 'Orders'; ru = 'Заказы'"));
			Элементы["Панель" + Сч].СписокВыбора.Добавить(НСтр("en = 'Routing lists'; ru = 'Маршрутные листы'"));
			Элементы["Панель" + Сч].СписокВыбора.Добавить(НСтр("en = 'Statistics'; ru = 'Статистика'"));
			Элементы["Панель" + Сч].СписокВыбора.Добавить(НСтр("en = 'Scheduler'; ru = 'Планировщик'"));
		Иначе
			Элементы["Панель" + Сч].СписокВыбора.Добавить(НСтр("en = 'Map'; ru = 'Карта'"));
			Элементы["Панель" + Сч].СписокВыбора.Добавить(НСтр("en = 'Event'; ru = 'События'"));
			Элементы["Панель" + Сч].СписокВыбора.Добавить(НСтр("en = 'Points'; ru = 'Пункты'"));
			Если ПолучитьКонстантуИспользоватьМониторинг() Тогда
				Элементы["Панель" + Сч].СписокВыбора.Добавить(НСтр("en = 'Report'; ru = 'Отчеты'"));
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ЗаполнитьПанели();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	уатЗащищенныеФункцииКлиент.уатСправочникФормаЭлементаПриОткрытии(Отказ, ДопПараметрыОткрытие);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("РабочиеСтолы_Запись", Объект.Ссылка, ЭтотОбъект);
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПанельПриИзменении(Элемент)
	
	Если НЕ СтрНайти(ЭтотОбъект[Элемент.Имя], НСтр("en = 'Report:'; ru = 'Отчет:'")) = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если Элемент.СписокВыбора.НайтиПоЗначению(ЭтотОбъект[Элемент.Имя]) = Неопределено Тогда
		ЭтотОбъект[Элемент.Имя] = "";
	КонецЕсли;

	ЭлементВыбораИмя = Элемент.Имя;

	Если ЭтотОбъект[Элемент.Имя] = НСтр("en = 'Report'; ru = 'Отчеты'") Тогда
		ЭлементВыбораИмя = Элемент.Имя;
		ПараметрыФормы = Новый Структура("ЗакрыватьПриВыборе", Истина);
		ОткрытьФорму("Справочник.уатРабочиеСтолы.Форма.ФормаВыбораОтчетов",ПараметрыФормы, Элемент);
		ЭтотОбъект[Элемент.Имя] = "";
	Иначе
		мЭлементВыбораИмя = "";
		ЕстьДубль = Ложь;
		Если ЭтотОбъект[Элемент.Имя] = Панель1 И Элемент.Имя <> Элементы.Панель1.Имя 
			И ЗначениеЗаполнено(ЭтотОбъект[Элемент.Имя]) И СтрНайти(ЭтотОбъект[Элемент.Имя], НСтр("en = 'Report:'; ru = 'Отчет:'")) = 0 Тогда
			Панель1 = "";
			мЭлементВыбораИмя = Элементы.Панель1.Имя;
			ЕстьДубль = Истина;
		КонецЕсли;
		Если ЭтотОбъект[Элемент.Имя] = Панель2 И Элемент.Имя <> Элементы.Панель2.Имя 
			И ЗначениеЗаполнено(ЭтотОбъект[Элемент.Имя]) И СтрНайти(ЭтотОбъект[Элемент.Имя], НСтр("en = 'Report:'; ru = 'Отчет:'")) = 0 Тогда
			Панель2 = "";
			мЭлементВыбораИмя = Элементы.Панель2.Имя;
			ЕстьДубль = Истина;
		КонецЕсли;
		Если ЭтотОбъект[Элемент.Имя] = Панель3 И Элемент.Имя <> Элементы.Панель3.Имя
			И ЗначениеЗаполнено(ЭтотОбъект[Элемент.Имя]) И СтрНайти(ЭтотОбъект[Элемент.Имя], НСтр("en = 'Report:'; ru = 'Отчет:'")) = 0 Тогда
			Панель3 = "";
			мЭлементВыбораИмя = Элементы.Панель3.Имя;
			ЕстьДубль = Истина;
		КонецЕсли;
		Если ЭтотОбъект[Элемент.Имя] = Панель4 И Элемент.Имя <> Элементы.Панель4.Имя
			И ЗначениеЗаполнено(ЭтотОбъект[Элемент.Имя]) И СтрНайти(ЭтотОбъект[Элемент.Имя], НСтр("en = 'Report: '; ru = 'Отчет:'")) = 0 Тогда
			Панель4 = "";
			мЭлементВыбораИмя = Элементы.Панель4.Имя;
			ЕстьДубль = Истина;
		КонецЕсли;
		
		Для Каждого ТекСтрока Из Объект.НастройкиПанелей Цикл
			Если ТекСтрока.Панель = ЭлементВыбораИмя Тогда
				ТекСтрока.Значение      = ЗаполнитьЗначениеНастройкиПоИмени(ЭтотОбъект[Элемент.Имя]);
				ТекСтрока.СсылкаНаОтчет = Неопределено;
				Если НЕ ЕстьДубль Тогда
					Прервать;
				Конецесли;
			КонецЕсли;
			
			Если ЕстьДубль И ТекСтрока.Панель = мЭлементВыбораИмя Тогда
				ТекСтрока.Значение  = ЗаполнитьЗначениеНастройкиПоИмени(ЭтотОбъект[мЭлементВыбораИмя]);
				ТекСтрока.СсылкаНаОтчет   = Неопределено;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПанельОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда 
		ОнлайнОтчет = ВыбранноеЗначение.ОнлайнОтчет;
		Отчет       = ВыбранноеЗначение.Отчет;
		
		Для Каждого ТекСтрока Из Объект.НастройкиПанелей Цикл
			Если ТекСтрока.Панель = ЭлементВыбораИмя Тогда
				ТекСтрока.Значение        = "Отчет";
				ТекСтрока.СсылкаНаОтчет   = Отчет;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		ВыбранноеЗначение = НСтр("en = 'Report: '; ru = 'Отчет:'") + " " + Отчет;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НазначениеПриИзменении(Элемент)
	
	Элементы.Панель1.СписокВыбора.Очистить();
	Элементы.Панель2.СписокВыбора.Очистить();
	Элементы.Панель3.СписокВыбора.Очистить();
	Элементы.Панель4.СписокВыбора.Очистить();

	Для Сч = 1 По 4 Цикл
		Если Объект.Назначение = НСтр("en = 'AWP Logistician'; ru = 'АРМ Логиста'") Тогда
			Элементы["Панель" + Сч].СписокВыбора.Добавить(НСтр("en = 'Map'; ru = 'Заказы'"));
			Элементы["Панель" + Сч].СписокВыбора.Добавить(НСтр("en = 'Event'; ru = 'Маршрутные листы'"));
			Элементы["Панель" + Сч].СписокВыбора.Добавить(НСтр("en = 'Points'; ru = 'Статистика'"));
			Элементы["Панель" + Сч].СписокВыбора.Добавить(НСтр("en = 'Report'; ru = 'Планировщик'"));
		Иначе
			Элементы["Панель" + Сч].СписокВыбора.Добавить(НСтр("en = 'Map'; ru = 'Карта'"));
			Элементы["Панель" + Сч].СписокВыбора.Добавить(НСтр("en = 'Event'; ru = 'События'"));
			Элементы["Панель" + Сч].СписокВыбора.Добавить(НСтр("en = 'Points'; ru = 'Пункты'"));
			Если ПолучитьКонстантуИспользоватьМониторинг() Тогда
			Элементы["Панель" + Сч].СписокВыбора.Добавить(НСтр("en = 'Report'; ru = 'Отчеты'"));
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Панель1 = "";
	Панель2 = "";
	Панель3 = "";
	Панель4 = "";
	
	Объект.НастройкиПанелей.Очистить();
	Для Счетчик = 1 По 4 Цикл
		НоваяСтрока = Объект.НастройкиПанелей.Добавить();
		НоваяСтрока.Панель = "Панель" + Счетчик;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьПанели()
	
	Если Объект.НастройкиПанелей.Количество() = 0 Тогда
		Для Счетчик = 1 По 4 Цикл
			НоваяСтрока = Объект.НастройкиПанелей.Добавить();
			НоваяСтрока.Панель = "Панель" + Счетчик;
		КонецЦикла;
	КонецЕсли;
	
	Для Каждого ТекСтрока Из Объект.НастройкиПанелей Цикл
		ЭтотОбъект[ТекСтрока.Панель] = ЗаполнитьПанельПоИмениНастройки(ТекСтрока.Значение, ТекСтрока.СсылкаНаОтчет);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ЗаполнитьЗначениеНастройкиПоИмени(ИмяЭлемента)
	
	Если ИмяЭлемента = НСтр("en = 'Orders'; ru = 'Заказы'") Тогда
		Возврат "Заказы";
	ИначеЕсли ИмяЭлемента = НСтр("en = 'Routing lists'; ru = 'Маршрутные листы'") Тогда
		Возврат "МаршрутныеЛисты";
	ИначеЕсли ИмяЭлемента = НСтр("en = 'Statistics'; ru = 'Статистика'") Тогда
		Возврат "Статистика";
	ИначеЕсли ИмяЭлемента = НСтр("en = 'Scheduler'; ru = 'Планировщик'") Тогда
		Возврат "Планировщик";
	ИначеЕсли ИмяЭлемента = НСтр("en = 'Map'; ru = 'Карта'") Тогда
		Возврат "Карта";
	ИначеЕсли ИмяЭлемента = НСтр("en = 'Event'; ru = 'События'") Тогда
		Возврат "События";
	ИначеЕсли ИмяЭлемента = НСтр("en = 'Points'; ru = 'Пункты'") Тогда
		Возврат "Пункты";
	ИначеЕсли ИмяЭлемента = "" Тогда
		Возврат "";
	Иначе
		Возврат "Отчет";
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ЗаполнитьПанельПоИмениНастройки(ИмяЭлемента, СсылкаНаОтчет = Неопределено)
	
	Если ИмяЭлемента = "Заказы" Тогда
		Возврат НСтр("en = 'Orders'; ru = 'Заказы'");
	ИначеЕсли ИмяЭлемента = "МаршрутныеЛисты" Тогда
		Возврат НСтр("en = 'Routing lists'; ru = 'Маршрутные листы'");
	ИначеЕсли ИмяЭлемента = "Статистика" Тогда
		Возврат НСтр("en = 'Statistics'; ru = 'Статистика'");
	ИначеЕсли ИмяЭлемента = "Планировщик" Тогда
		Возврат НСтр("en = 'Scheduler'; ru = 'Планировщик'");
	ИначеЕсли ИмяЭлемента = "Карта" Тогда
		Возврат НСтр("en = 'Map'; ru = 'Карта'");
	ИначеЕсли ИмяЭлемента = "События" Тогда
		Возврат НСтр("en = 'Event'; ru = 'События'");
	ИначеЕсли ИмяЭлемента = "Пункты" Тогда
		Возврат НСтр("en = 'Points'; ru = 'Пункты'");
	ИначеЕсли ИмяЭлемента = "Отчет" Тогда
		Возврат НСтр("en = 'Report: '; ru = 'Отчет:'") + СсылкаНаОтчет;
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПолучитьКонстантуИспользоватьМониторинг()
	
	Возврат Константы.уатИспользоватьМониторинг.Получить();
	
КонецФункции

#КонецОбласти
